app/controllers/funding_products_controller.rb

  def index
    @funding_products = FundingProduct.all
---
SELECT "funding_products".* FROM "funding_products"

  def create
    @funding_product = FundingProduct.new(funding_product_params)

    respond_to do |format|
      if @funding_product.save
---
INSERT INTO "funding_products" ("product_id", "category_id", "title", "deadline", "achieve_rate", "achieve_money", "supporters_number", "brand", "product_detail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @funding_product.update(funding_product_params)
---
UPDATE "funding_products" SET "product_id" = ?, "category_id" = ?, "title" = ?, "updated_at" = ? WHERE "funding_products"."id" = ?  [["product_id", "히트텍"], ["category_id", "패션 잡화"], ["title", "[4만후기/앵콜] 스타일과 따뜻함을 #한장으로 히트터치 노브라티&터틀넥"], ["updated_at", "2022-11-29 06:34:41.112680"], ["id", 1]]

  def destroy
    @funding_product.destroy
---
DELETE FROM "funding_products" WHERE "funding_products"."id" = ?  [["id", 5]]

    def set_funding_product
      @funding_product = FundingProduct.find(params[:id])
---
SELECT  "funding_products".* FROM "funding_products" WHERE "funding_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]