app/controllers/homes_controller.rb

SELECT "homes".* FROM "homes"
---
  def index
    @homes = Home.all

INSERT INTO "homes" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "0"], ["content", "00"], ["created_at", "2022-11-23 05:50:38.787537"], ["updated_at", "2022-11-23 05:50:38.787537"]]
---
  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save

DELETE FROM "homes" WHERE "homes"."id" = ?  [["id", 1]]
---
  def destroy
    @home.destroy

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_home
      @home = Home.find(params[:id])