app/controllers/sellers_controller.rb

SELECT "sellers".* FROM "sellers"
---
  def index
    @sellers = Seller.all

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def homepage_seller
	  @seller = Seller.find(params[:seller_id])

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def makerpage_seller
	  @seller = Seller.find(params[:seller_id])

INSERT INTO "sellers" ("seller_id", "user_id", "company_name", "ceo_name", "company_address", "ceo_email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @seller = Seller.new(seller_params)

    respond_to do |format|
      if @seller.save

UPDATE "sellers" SET "registration_num" = ?, "company_name" = ?, "ceo_name" = ?, "updated_at" = ? WHERE "sellers"."id" = ?  [["registration_num", 1011112222], ["company_name", "삼삼구회사"], ["ceo_name", "구삼삼"], ["updated_at", "2022-11-28 04:38:58.259870"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @seller.update(seller_params)

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_seller
      @seller = Seller.find(params[:id])