app/controllers/user_likes_controller.rb

  def index
    @user_likes = UserLike.all
---
SELECT "user_likes".* FROM "user_likes"